Revit 2027 API
WorksetConfiguration.Open Method
 Sets a group of user-created worksets to open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Open(
	IList<WorksetId> worksetsToOpen
)
Public Sub Open (
	worksetsToOpen As IList(Of WorksetId)
)
public:
void Open(
	IList<WorksetId^>^ worksetsToOpen
)
member Open :
        worksetsToOpen : IList<WorksetId> -> unit
Parameters
worksetsToOpen IList<WorksetId>
 The group of user-created worksets to open. Non-user-created worksets and invalid workset ids will be ignored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Calling this method on a configuration created with options other than WorksetConfigurationOption.OpenAllWorksets will set these worksets to be explicitly opened. If all worksets are set to open, the configuration will be unchanged. Worksets other than the inputs are unaffected.
See Also
Reference
WorksetConfiguration Class
Autodesk.Revit.DB Namespace